app/controllers/student_controller.rb

INSERT INTO "students" ("firstname", "lastname", "emailid", "mobilenumber", "date_of_birth", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create

		 @student = Student.new(student_params)

         if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "mobilenumber" = ?, "password" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["mobilenumber", "8983401613"], ["password", "123456"], ["updated_at", "2018-03-13 12:40:42.276126"], ["id", 1]]
---
def update
    @student=Student.find(params[:id])
    if @student.update(student_params)