app/controllers/students_controller.rb

INSERT INTO "students" ("firstname", "lastname", "emailid", "mobilenumber", "date_of_birth", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		 #render plain: params[:student].inspect
		 @student = Student.new(student_params)

	 	 if @student.save